app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets" WHERE (user_id = 1)
---
  def index
    @wallets = Wallet.all

INSERT INTO "wallets" ("name", "comments", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Minha 1 carteira"], ["comments", "Essa carteira pra investimentos pesados"], ["user_id", 1], ["created_at", "2015-11-16 17:23:29.254058"], ["updated_at", "2015-11-16 17:23:29.254058"]]
---
  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_wallet
      @wallet = Wallet.find(params[:id])